In [2]:
import sqlite3

In [3]:
import sqlite3 as db
#import pandas as pd

In [4]:
import pandas as pd

In [5]:
conn = db.connect('LabBancoIfpe.db')
cursor = conn.cursor()

In [6]:
create_cliente_table = '''
    CREATE TABLE cargos (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  cargo VARCHAR(50)
);
'''
cursor.execute(create_cliente_table)

OperationalError: table cargos already exists

In [ ]:
create_cliente_table = '''
    CREATE TABLE cargos (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  cargo VARCHAR(50)
);
'''
cursor.execute(create_cliente_table)

In [6]:
create_unidades_table = '''
    CREATE TABLE unidades (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  unidade VARCHAR(50)
);
'''
cursor.execute(create_unidades_table)

In [7]:
create_servidores_table = '''
    CREATE TABLE servidores (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  nome VARCHAR(50),
  cargo_id INTEGER,
  unidade_id INTEGER,
  FOREIGN KEY (cargo_id) REFERENCES cargos(id),
  FOREIGN KEY (unidade_id) REFERENCES unidades(id)
);
'''
cursor.execute(create_servidores_table)

In [24]:
cargos = [
('Professor'),
('Analista'),
('Tecnico'),
('Contador'),
]
insert_cargos_query = '''
    INSERT INTO cargos (cargo)
    VALUES (?)
    '''
cursor.executemany(insert_cargos_query, cargos)

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 1, and there are 9 supplied.

In [25]:
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Professor', 'Mestrado')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Analista', 'Graduação')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Tecnico', 'Ensino Médio')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Contador', 'Graduação')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Biomedico', 'Graduação')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Administrador', 'Graduação')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Fisico', 'Doutorado')")
cursor.execute("INSERT INTO cargos (cargo, escolaridade) VALUES ('Musico', 'Ensino Médio')")
conexao.commit()

OperationalError: table cargos has no column named escolaridade

In [22]:
cursor.execute('''
    SELECT servidores.nome, cargos.cargo, unidades.unidade
    FROM servidores
    INNER JOIN cargos ON servidores.cargo_id = cargos.id
    INNER JOIN unidades ON servidores.unidade_id = unidades.id
''')

# %%
# Obter o resultado da consulta
result = cursor.fetchall()

# Exibir o resultado
for row in result:
    print(row)

('Chico Lopes', 'Professor', 'Abreu e Lima')
('Tiberio', 'Analista', 'Escada')
('Asdrubal', 'Tecnico', 'Ipojuca')
('Epaminondas', 'Contador', 'Palmares')
('Lia de Itamaraca', 'Biomedico', 'Olinda')
('Andre Rio', 'Administrador', 'Igarassu')
('Reginaldo Rossi', 'Assistente', 'Afogados da Ingazeira')
('Gonzaga', 'Secretario', 'Pesqueira')

In [26]:
cursor.execute('''
    SELECT servidores.nome, cargos.cargo, unidades.unidade
    FROM servidores
    INNER JOIN cargos ON servidores.cargo_id = cargos.id
    INNER JOIN unidades ON servidores.unidade_id = unidades.id
''')

# %%
# Obter o resultado da consulta
result = cursor.fetchall()

# Exibir o resultado
for row in result:
    print(row)

('Chico Lopes', 'Professor', 'Abreu e Lima')
('Tiberio', 'Analista', 'Escada')
('Asdrubal', 'Tecnico', 'Ipojuca')
('Epaminondas', 'Contador', 'Palmares')
('Lia de Itamaraca', 'Biomedico', 'Olinda')
('Andre Rio', 'Administrador', 'Igarassu')
('Reginaldo Rossi', 'Assistente', 'Afogados da Ingazeira')
('Gonzaga', 'Secretario', 'Pesqueira')

In [27]:
linha

('Gonzaga', 'Secretario')

In [28]:
resultado

[('Chico Lopes', 'Professor'),
 ('Tiberio', 'Analista'),
 ('Asdrubal', 'Tecnico'),
 ('Epaminondas', 'Contador'),
 ('Lia de Itamaraca', 'Biomedico'),
 ('Andre Rio', 'Administrador'),
 ('Reginaldo Rossi', 'Assistente'),
 ('Gonzaga', 'Secretario')]

In [29]:
cursor.execute('''
    ALTER TABLE cargos
    ADD COLUMN escolaridade varchar(50)
''')


conn.commit()

OperationalError: duplicate column name: escolaridade

In [ ]:
cursor.execute('''
    UPDATE escolaridade
    SET idade = 30
    WHERE nome = 'Chico Tripa'
''')

# %%
# Confirmar as alterações na tabela
conn.commit()

In [ ]:
cursor.execute('''
    UPDATE cargos
    SET escolaridade = 
        CASE
            WHEN id = 1 THEN 'Doutorado'
            WHEN id = 2 THEN 'Pós-Graduação'
            WHEN id = 3 THEN 'Ensino Médio'
            WHEN id = 4 THEN 'Doutorado'
            WHEN id = 5 THEN 'Pós-Graduação'
            WHEN id = 6 THEN 'Ensino Médio'
            WHEN id = 7 THEN 'Pós-Graduação'
            WHEN id = 8 THEN 'Mestrado'
            ELSE 'Graduação'
        END
    WHERE id IN (1, 2, 3, 4, 5, 6, 7, 8) -- IDs das linhas que deseja atualizar
''')

# %%
# Confirmar as alterações na tabela
conn.commit()

In [ ]:
cursor.execute('''
    UPDATE 
    cargos
    SET escolaridade = 
        CASE
            WHEN id = 1 THEN 'Doutorado'
            WHEN id = 2 THEN 'Pós-Graduação'
            WHEN id = 3 THEN 'Ensino Médio'
            ELSE 'Graduação'
        END
    WHERE id IN (1, 2, 3, 4) -- IDs das linhas que deseja atualizar
''')

# %%
# Confirmar as alterações na tabela
conn.commit()

In [ ]:
cursor.execute('''
    UPDATE Servidores
    SET unidade_id = 
        CASE
            WHEN id = 1 THEN '1'
            WHEN id = 2 THEN '2'
            WHEN id = 3 THEN '3'
            WHEN id = 4 THEN '4'
            WHEN id = 5 THEN '5'
            WHEN id = 6 THEN '6'
            WHEN id = 7 THEN '7'
            WHEN id = 8 THEN '8'
            
            
            ELSE 'Graduação'
        END
    WHERE id IN (1, 2, 3, 4, 5, 6, 7, 8 )-- IDs das linhas que deseja atualizar
''')

# %%
# Confirmar as alterações na tabela
conn.commit()